package com.cloud.tao.util;

import android.Manifest;

/**
 * sunny created at 2016/10/28
 * des: 用户协议
 */
public class Constants {

    /**
     * 针对android 6.0动态权限检查集合
     */
    public String[] permissions = {Manifest.permission.READ_EXTERNAL_STORAGE};

    public static final int PageSize = 10;

    public static final String userAgreement =
                    "一、合伙人服务属性\n" +
                    "“云之道”合伙人服务系统是云之道（深圳）网络科技有限公司独立自主开发，联合众多联盟商家精心打造“云之道”多平台融合性生态系统，把交易逐步转化为交换，让价值在交换中通过金融和资本产生倍增和裂变，通过合伙人消费，获得消费积分，让合伙人持续享有积分收益的VIP服务。\n" +
                    "\n" +
                    "二、\t合伙人资格\n" +
                    "“云之道”合伙人服务适用中华人民共和国法律，仅限具有完全名事行为能力的人享有、使用。\n" +
                    "\n" +
                    "三、\t合伙人申请流程\n" +
                    "1、\t申请渠道：通过我公司授权创投合伙商从我公司官方 “云之道” 合伙人服务系统APP申请；\n" +
                    "2、\t申请资料：申请人员如实填写个人信息，通过创投合伙商向我公司提交资料；\n" +
                    "3、\t合伙人资格审查:由我公司授权创投合伙商和我公司服务部负责对准会员申请进行资格审查；\n" +
                    "4、\t缴纳费用：通过我公司审核的准入合伙人，通知其缴纳一定的系统建设费；\n" +
                    "5、\t合伙人资格：公司通过创投合伙商向已缴费系统建设费合伙人资格；\n" +
                    "6、\t绑定银行卡：由合伙人自行选择或在我公司指定银行办理个人银行卡并与手机进行绑定。\n" +
                    "\n" +
                    "四、\t合伙人激活与信用积分\n" +
                    "1、\t合伙人充值激活：合伙人通过我公司合伙人资格审查，通过我公司官方“云之道”合伙人APP进行消费并激活；\n" +
                    "2、\t绑定银行卡激活：合伙人根据银联要求，及时更改银行密码并激活；\n" +
                    "3、\t合伙人积分分为待返积分与可用积分，待返积分为可预期收益，可积分属于当期收益；\n" +
                    "4、\t待返积分在合伙人消费时获得，合伙人可使用待返积分到联盟商家和“云之道”平台进行消费；\n" +
                    "5、\t可用积分为我公司按每天合伙人待返积分的一定比例返还给合伙人的积分，可用于消费。\n" +
                    "\n" +
                    "五、合伙人收益与积分使用\n" +
                    "1、\t获得VIP积分：合伙人缴纳一定的服务费，一次性消费即获得等值金额的信用积分。如消费10000元，并缴纳服务费500元，另获得10500待返积分，在“云之道“消费平台1积分=1元；\n" +
                    "2、\t积分返还：由我公司每天将合伙人的待返积分总额一定比例（约0.05%，递减式）返还给合伙人，记入合伙人可用积分；\n" +
                    "3、\t积分消费：合伙人可在任意联盟商家（线上及线下）使用待返积分进行相关商品的积分消费；\n" +
                    "4、\t可用积分抵扣现金费用：合伙人可使用可用积分在联盟商家进行相关商品的现金抵扣；\n" +
                    "5、\t增加银行信用：通过使用绑定银行卡进行消费，获得高价值回报的银行信用。\n" +
                    "\n" +
                    "六、合伙人权益保障\n" +
                    "1、\t合伙人信息保密：合伙人注册信息，合伙人利用“云之道”服务系统消费及在我公司“云之道”平台进行消费、抵现等所有信息，均由我公司负责保密；\n" +
                    "2、\t合伙人权益保护：我公司负责保证本系统持续正常稳定运行，保证如实记录合伙人积分信息，不因创投合伙商、加盟商家变动等影响合伙人的任何权益；\n" +
                    "3、\t“云之道”合伙人于我公司联盟商家消费，享受联盟商家优惠折扣，不受地域限制；\n" +
                    "4、\t合伙人如因在本系统交易平台购买商品与销售商产生纠纷争议，本系统交易平台客服可协调双方调解以便公平合理解决，如调解无法达成一致，用户当自行依法律途径解决。\n" +
                    "\n" +
                    "七、合伙人须知\n" +
                    "1、\t合伙人入伙服务消费：首次申请合伙人，需向我公司缴纳各级合伙人费用（含系统维护费（年）；\n" +
                    "2、\t合伙人系统维护费（年）：合伙人入伙之日起，第二年度起需按年度向我公司缴纳系统维护费（年）；\n" +
                    "3、\t绑定银行卡充值：一次性充值20000元及以下，应向我公司缴纳5%服务费；超过20000元，为8%；\n" +
                    "4、\t可用积分消费服务：收取不高于消费积分额13%的服务费；\n" +
                    "5、\t绑定银行卡与其他银行卡一样，归持卡人所有，由持有人负责使用、保管；\n" +
                    "7、\t合伙人绑定银行卡需通过我公司“云之道”平台结合使用积分消费;\n" +
                    "8、\t未成为合伙人，在其他商家或联盟商家产生的消费，不能使用积分；\n" +
                    "9、\t因合伙人提供资料不合法，不真实等原因，以致银行审核不合格，不能如期办理绑定银行卡的，由合伙人负全责，如合伙人已缴纳入伙服务费用，我公司将其视为已发生的有偿服务费，不予退还；\n" +
                    "\n" +
                    "八、合伙人有效期限\n" +
                    "合伙人自办理之日起长期有效。合伙人需按时缴纳系统维护费（年），逾期不交系统维护费（年），视为合伙人自动退出合伙人资格，合伙人账户内积分（包括待返积分与可用积分）将自动清零（成为合伙人第一年度免系统维护费）。本系统可以默认系统维护费自动扣缴。\n" +
                    "\n" +
                    "九、如遇不可抗力或国家相关政策法律变更，致使本协议须变更或无法履行已至解除，本公司不承担任何违约赔偿责任。\n" +
                    "\n" +
                    "十、法律适用、管辖及生效\n" +
                    "1、\t本协议的订立、执行个解释及争议的解决均适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应友好协商解决；协商不成时，任何一方均可向协议签订人民法院提起诉讼。本协议签订地为深圳市南山区大冲国际商务中心C座1802。\n" +
                    "2、\t本协议内容以加粗方式显著标识的条款，请您着重阅读。你点击“同意”按钮及视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。\n" +
                    "\n" +
                    "十一、其他\n" +
                    "1、\t为保障您的权益，请在消费结账时主动出示合伙人账户，及时通过我公司会员管理中心APP查询积分；\n" +
                    "2、\t如你对合伙人有任何疑问，请及时垂询合伙人管理中心统一服务电话0755-2267-3107；\n" +
                    "3、\t本手册的解释权归云之道（深圳）网络科技有限公司所有，公司保留对本手册所述内容之修订权、终止权。\n" +
                    "\n" +
                    "\n" +
                    "以上内容如有未尽详细之处，欢迎随时垂询合伙人管理中心，敬请您及时反馈合伙人的账户使用情况我们将不胜感激，有您的真诚支持，我们将做的更好，让您获得更多满意！\n";

}
